T_BAITS = [
    {"name": "ข้าวปั้นสามเหลี่ยม", "exp": 153, "tr": 20},
    {"name": "ข้าวผัดกุ้งแห้ง", "exp": 703, "tr": 100},
    {"name": "กิ้งกือรมควัน", "exp": 2363, "tr": 500},
    {"name": "ไส้เดือนสีทอง", "exp": 5644, "tr": 1500},
    ##{"name": "ไส้เดือนทะเลเพชร", "exp": 10701, "tr": 5000},
    ]

# เทศกาลชูซอก : -1
C_BAITS = [
    {"name": "ไส้เดือนจักรพรรดิ", "exp": 19562, "cash" : 49},
    {"name": "ไส้เดือนนายพล", "exp": 21658, "cash" : 49},
    {"name": "ไส้เดือนราชินี", "exp": 22056, "cash" : 49},
    {"name": "ไส้เดือนแห่งชัยชนะ", "exp": 21972, "cash" : 49},
    {"name": "ไส้เดือนแสงแดด", "exp": 22124, "cash" : 49},
    {"name": "ไส้เดือนแสงดาว", "exp": 22223, "cash" : 49},
    {"name": "ไส้เดือนจ้าวสมุทรจุติ", "exp": 22189, "cash" : 49},
    {"name": "ไส้เดือนแห่งชัยชนะ", "exp": 22172, "cash" : 49},
    ##{"name": "ไส้เดือนดวงจันทร์", "exp" :30160, "cash" : -1}, # กิจกรรมเทศกาลชูซอก (วันไหว้พระจันทร์)
    ##{"name": "ไส้เดือนทะเลทองคำพิเศษ", "exp" :16932, "cash" : -2}, # กิจกรรมจำกัดเวลา
    ##{"name": "ไส้เดือนทะเลเพชรพิเศษ", "exp" :32103, "cash" : -2}, # กิจกรรมจำกัดเวลา
    
    ]


#### เบ็ดตกปลา

FISHING_RODS = {
    "เลือกเบ็ดตกปลา": (0, 0, 0),
    "เบ็ดตกปลาโนเบลส": (30, 70, 200),
    "เบ็ดตกปลาเทลส์รันเนอร์": (15, 20, 150),
    "เบ็ดตกปลาปิเอโร่" : (60, 100, 0),
    "เบ็ดตกปลาดาบไม้ไผ่": (40, 80, 50),
    "เบ็ดตกปลาเทวดา": (30, 90, 100),
    "เบ็ดตกปลาปีศาจ": (50, 70, 100),
    "เบ็ดตกปลาเมจิกสตาร์": (40, 70, 50),
    "เบ็ดตกปลาดาบกุหลาบน้ำเงิน": (30, 80, 50),
    "เบ็ดตกปลาเซียนคังแทกง": (60, 100, 0),
    "เบ็ดตกปลาไม้ไผ่": (60, 120, 0),
    "เบ็ดตกปลากระต่ายชมจันทร์" : (15, 20, 300), # กิจกรรมเทศกาลชูซอก
    "เบ็ดตกปลาวิญญาณ": (50, 90, 150),
    "เบ็ดตกปลาไม้กวาดกรีนวู้ด" : (50, 110, 50),
    "เบ็ดตกปลาไม้กวาดพิงก์วู้ด" : (60, 100, 50),
    "เบ็ดตกปลาแมวเหมียว" : (60, 110, 25),
    "เบ็ดตกปลาน้องหมา" : (50, 120, 25),

}

SORTED_RODS_KEYS = sorted(k for k in FISHING_RODS if k != "เลือกเบ็ดตกปลา")
ORDERED_ROD_KEYS = ["เลือกเบ็ดตกปลา"] + SORTED_RODS_KEYS

FISHING_FRIENDS = {
    "เพื่อนตกปลา" : (0, 0, 0),
    
    "พ่อบ้านกระต่ายและกระต่ายน้อย": (10, 0, 100),
    "นากนักค้า": (0, 10, 100),

    "ปราสาททรายกับโคอาล่า": (8, 10, 100),
    
    ##"มิลด็อกกำลังตกปลา": (5, 5, 140), 
    ##"ซัลด็อกกำลังตกปลา": (10, 10, 120),

    "ขณะตกปลา": (2, 2, 15), 
    "ยอดเยี่ยมมาก!": (4, 4, 15),
    "หมาน้อยน้ำลายสอ": (2, 10, 100),

    "หนูสีขาวแสนฉลาด": (0, 8, 60),
    "หนูสีชมพูแสนฉลาด": (8, 8, 60),
    "หนูสีฟ้าแสนฉลาด": (4, 8, 60),
    
    "เบาะน้องเหมียว มิดไนท์": (4, 4, 80),
    "เบาะน้องเหมียว ป่านอร์เวย์": (8, 0, 60),
    "เบาะน้องเหมียว ขาว": (0, 8, 40),
    
    "แมวน้ำ สีขาว ขี้เล่น": (2, 4, 40),
    "แมวน้ำ สีดำ ขี้เล่น": (0, 5, 30), 
    "แมวน้ำ สีฟ้า ขี้เล่น": (5, 5, 30),
    
    "ฮังกรีแบร์ เหลือง": (0, 6, 20), 
    "ฮังกรีแบร์ ชมพู": (6, 0, 20),
    "ฮังกรีแบร์ ขาว": (3, 3, 20),
    
    #"วิญญาณแค้นจีรองเบรอส": (0, 0, 150),
    
    
    
}

SORTED_FRIENDS_KEYS = sorted(k for k in FISHING_FRIENDS if k != "เพื่อนตกปลา")
ORDERED_FRIENDS_KEYS = ["เพื่อนตกปลา"] + SORTED_FRIENDS_KEYS
