import streamlit as st

UPDATES = [
    {
        "title": "อัปเดตตามฟีดแบ็ก (26-03-11)",
        "items": [
            "เพิ่ม **เบ็ดตกปลา** (เช่น เบ็ดตกปลาไม้กวาดกรีนวู้ด รวม 4 ชิ้น)",
        ],
        "link": "",
        "note": "หากมีข้อมูลใดตกหล่น สามารถใช้ปุ่มฟีดแบ็กเพื่อแจ้งให้ทราบได้ครับ",
    },
    {
        "title": "อัปเดตตามฟีดแบ็ก (26-01-26)",
        "items": [
            "แสดงเป็นค่าประสบการณ์ (EXP) เมื่อถึงเลเวลสูงสุด (จากเดิม: ล็อกไว้ที่ 100%)",
        ],
        "link": "",
        "note": "หากมีข้อมูลใดตกหล่น สามารถใช้ปุ่มฟีดแบ็กเพื่อแจ้งให้ทราบได้ครับ",
    },
    {
        "title": "อัปเดตตามฟีดแบ็ก (26-01-23)",
        "items": [
            "เพิ่ม **เบ็ดตกปลากระต่ายชมจันทร์**",
            "เพิ่ม **เพื่อนตกปลา** (พ่อค้านาก และอื่นๆ อีก 6 ตัว)",
        ],
        "link": "",
        "note": "หากมีข้อมูลใดตกหล่น สามารถใช้ปุ่มฟีดแบ็กเพื่อแจ้งให้ทราบได้ครับ",
    },
    
    {
        "title": "อัปเดตตามฟีดแบ็ก (26-01-05)",
        "items": [
            "เพิ่ม **ไส้เดือนมงกุฎสีรุ้ง**",
        ],
        "link": "",
        "note": "หากมีข้อมูลอื่นๆ ตกหล่น สามารถใช้ปุ่มฟีดแบ็กเพื่อแจ้งให้ทราบได้ครับ!",
    },
    {
        "title": "Tales Runner อัปเดตเดือนตุลาคม ครั้งที่ 2",
        "items": [
            "นำเบ็ดตกปลากระต่ายชมจันทร์ออก",
            "เพิ่มไอเทมจากการอัปเดต: **เบ็ดตกปลาวิญญาณ**, **วิญญาณแค้นจีรองเบรอส**, **[ความสามารถ] กระชังตกปลาแบบพกพา**",
            "เพิ่ม **ไส้เดือนทะเลทองคำพิเศษ**, **ไส้เดือนทะเลเพชรพิเศษ**",
        ],
        "link": "https://tr.rhaon.co.kr/news/updates/77?page=1",
        "note": "หากมีข้อมูลอื่นๆ ตกหล่น สามารถใช้ปุ่มฟีดแบ็กเพื่อแจ้งให้ทราบได้ครับ!",
    },
    {
        "title": "Tales Runner อัปเดตเดือนตุลาคม ครั้งที่ 1",
        "items": [
            "เพิ่มไอเทมจากกิจกรรมเทศกาลชูซอก: **เบ็ดตกปลากระต่ายชมจันทร์**, **ไส้เดือนดวงจันทร์**",
            "แก้ไขข้อมูลตามการปรับปรุงเวลาของเพื่อนตกปลา",
            "เพิ่มข้อมูลจำนวนที่คาดว่าจะได้รับใน **30 นาที, 1 ชั่วโมง** สำหรับ **เบ็ดตกปลาเทลส์รันเนอร์** และ **เบ็ดตกปลากระต่ายชมจันทร์**",
        ],
        "link": "https://tr.rhaon.co.kr/news/updates/76?page=1",
        "note": "หากต้องการเสนอแนะการปรับปรุงอื่นๆ สามารถใช้ปุ่มฟีดแบ็กได้ครับ!",
    },
  
]


@st.dialog("รายละเอียดการอัปเดต")
def update_info():
    for i, update in enumerate(UPDATES):
        with st.expander(update['title'], expanded=(i == 0)):
            for idx, item in enumerate(update["items"], start=1):
                st.markdown(f"{idx}. {item}  ")
            check_link = f"""
อ้างอิง : [{update['title']}]({update['link']})  
> {update['note']}  
""" if update['link'] != '' else f"""
> {update['note']}  
"""
            st.markdown(check_link)
